AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/Серверный/Ext/Module.bsl
&НаСервере
Функция ПолучитьЦенуЛекарстваНаСервере(Лекарство)
    // Создаем запрос для получения цены
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ЦеныНаЛекарства.Цена
    |ИЗ
    |    Справочник.ЦеныНаЛекарства КАК ЦеныНаЛекарства
    |ГДЕ
    |    ЦеныНаЛекарства.Лекарство = &Лекарство";
    
    Запрос.УстановитьПараметр("Лекарство", Лекарство);
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    // Если есть результат, то возвращаем цену
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Цена;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции                 

&НаСервере
Процедура ОбновитьОстаткиНаСервере(ТабличнаяЧасть)
    // Проходим по всем строкам табличной части
    Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
        // Получаем данные из строки
        Лекарство = СтрокаТабличнойЧасти.Лекарство;
        Количество = СтрокаТабличнойЧасти.Количество;
        
        // Обновляем остатки в регистре накопления
        РегистрОстатков = РегистрыНакопления.ОстаткиНаСкладе.СоздатьМенеджерЗаписи();
        РегистрОстатков.Измерения.Лекарство = Лекарство;
        РегистрОстатков.Ресурсы.Количество = Количество;
        РегистрОстатков.Записать();
    КонецЦикла;
КонецПроцедуры
